tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "python@3.9"
brew "libavif"
brew "gd"
brew "git"
brew "go"
brew "python@3.10"
brew "gobject-introspection"
brew "golangci-lint"
brew "gopls"
brew "harfbuzz"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "perl"
brew "latexindent"
brew "libxft"
brew "nano"
brew "neofetch"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "rust"
brew "rustfmt"
brew "texlive"
brew "wget"
cask "alt-tab"
cask "android-studio"
cask "exodus"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "protonvpn"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
