tap "fmenezes/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.9"
brew "clang-format"
brew "cppcheck"
brew "gcc"
brew "libavif"
brew "gd"
brew "ghostscript"
brew "git"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "gopls"
brew "harfbuzz"
brew "openjdk@17"
brew "gradle"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "perl"
brew "latexindent"
brew "libxft"
brew "nano"
brew "neofetch"
brew "node"
brew "openjdk"
brew "openjdk@11"
brew "python@3.10"
brew "ruby", link: true
brew "rust"
brew "rustfmt"
brew "starship"
brew "texlive"
brew "tree"
brew "wget"
cask "alt-tab"
cask "android-studio"
cask "discord"
cask "exodus"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "protonvpn"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "Catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "James-Yu.latex-workshop"
vscode "jbenden.c-cpp-flylint"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "magicstack.MagicPython"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "shengchen.vscode-checkstyle"
vscode "SteveBushResearch.BuildOutputColorizer"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "xaver.clang-format"
