tap "fmenezes/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "perl"
brew "biber"
brew "boost"
brew "python@3.12"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "cppcheck"
brew "folly"
brew "gcc"
brew "libavif"
brew "gd"
brew "ghostscript"
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "googletest"
brew "harfbuzz"
brew "openjdk"
brew "gradle"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "latexindent"
brew "libxft"
brew "llvm@16"
brew "node"
brew "markdownlint-cli"
brew "nano"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "openjdk@11"
brew "openjdk@17"
brew "pygments"
brew "pypy3.10"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.10"
brew "ripgrep"
brew "ruby", link: true
brew "rust"
brew "rustfmt"
brew "starship"
brew "texlive"
brew "tree"
brew "wget"
cask "alt-tab"
cask "android-studio"
cask "chatgpt"
cask "clion"
cask "discord"
cask "displaylink"
cask "exodus"
cask "firefox"
cask "google-chrome"
cask "kitty"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "orion"
cask "postman"
cask "protonvpn"
cask "rectangle"
cask "slack"
cask "spotify"
cask "surfshark"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "catppuccin.catppuccin-vsc"
vscode "esbenp.prettier-vscode"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "magdalenalipka.tokyo-night-frameless"
vscode "magicstack.magicpython"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "mvllow.rose-pine"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "stevebushresearch.buildoutputcolorizer"
vscode "tristen-allen.lc-2200-language-support"
vscode "twxs.cmake"
