tap "fmenezes/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "boost"
brew "cairo"
brew "clang-format"
brew "cppcheck"
brew "libavif"
brew "gd"
brew "ghostscript"
brew "git"
brew "googletest"
brew "harfbuzz"
brew "openjdk"
brew "gradle"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "perl"
brew "latexindent"
brew "libxft"
brew "llvm"
brew "python@3.11"
brew "nano"
brew "neofetch"
brew "ninja"
brew "node"
brew "openjdk@11"
brew "openjdk@17"
brew "pypy3.10"
brew "python-tk@3.11"
brew "python@3.10"
brew "ruby", link: true
brew "rust"
brew "rustfmt"
brew "starship"
brew "texlive"
brew "tree"
brew "wget"
cask "alt-tab"
cask "android-studio"
cask "clion"
cask "discord"
cask "displaylink"
cask "exodus"
cask "google-chrome"
cask "kitty"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "orion"
cask "postman"
cask "protonvpn"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
vscode "esbenp.prettier-vscode"
vscode "James-Yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "magicstack.MagicPython"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cmake-tools"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
